# Создайте класс и поля соответствующему вашему варианту (поля статические и динамические).
# Создайте три метода (класса, объекта и статический). Выберете поле или метод для реализации инкапсуляции.
# Пропишите запись и считывание (get, set) инкапсулированных полей.
# Вар.1 Kласс Book: id, Название, Автор (ы), Издательство, Год издания, Количество страниц, Цена, Тип переплета.

class Book:
    default_id = '1'
    default_name = 'Name'
    default_author = '1'
    default_office = '1'
    default_page = '1'
    default_price = '1'
    default_binding = '1'

